//  Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
// 5, 25 -> да
// -4, 16 -> да
// 25, 5 -> да
// 8,9 -> нет

Console.WriteLine("Введите первое число");
int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите второе число");
int b = Convert.ToInt32(Console.ReadLine());

int result1 = b*b;
int result2 = a*a;

if (result1==a && result2==b)
{
    Console.WriteLine("Да");
}
else 
{
    Console.WriteLine("Нет");
}